import { Component } from 'react';
import './MainListItem.scss';

class MainListItem extends Component {
    constructor(props) {
        super(props);
        this.state = {
            complet: this.props.complet,
            favorite: this.props.favorite,
        };
        
    }
    
    onComplet = () => {
        const { onAddComplet, onDeleteComplet } = this.props;
        this.setState(({ complet }) => ({
            complet: !complet,
        }));
        this.onAddMes();
        setTimeout(() => {
            this.onAddMes();
        }, 2000);
        if (!this.state.complet) {
            onAddComplet();
        } else {
            onDeleteComplet();
        }
    };

    onFavorite = () => {
        const { onAddFav, onDeleteFav } = this.props;
        this.setState(({ favorite }) => ({
            favorite: !favorite,
        }));
        this.onAddMesFav();
        setTimeout(() => {
            this.onAddMesFav();
        }, 2000);
        if (!this.state.favorite) {
            onAddFav();
        } else {
            onDeleteFav();
        }
    };

    onAddMes = () => {
        this.setState(({ addMesShow }) => ({
            addMesShow: !addMesShow,
        }));
    };

    onAddMesFav = () => {
        this.setState(({ addMesShowFav }) => ({
            addMesShowFav: !addMesShowFav,
        }));
    };

    render() {
        const { name, image, onDelete, time, date } = this.props;
        const { complet, favorite, addMesShow, addMesShowFav } = this.state;
        return (
            <li
                className={
                     complet
                        ? 'Main-list-item _completed'
                        : 'Main-list-item'
                }
            >
                <div
                    className={
                        addMesShow ? 'Header__add-mes _show' : 'Header__add-mes'
                    }
                >
                    <div className="Header__add-mes-wrapper">
                        <span>{name} </span>
                        { complet
                            ? 'просмотрено'
                            : 'удалено из просмотренного'}
                    </div>
                </div>
                <div
                    className={
                        addMesShowFav
                            ? 'Header__add-mes-fav _show'
                            : 'Header__add-mes-fav'
                    }
                >
                    <div className="Header__add-mes-wrapper">
                        <span>{name} </span>
                        {favorite
                            ? 'добавлено в избранное'
                            : 'удалено из избранного'}
                    </div>
                </div>
                <span
                    className={
                         complet
                            ? 'Main-list-item__name _completed'
                            : 'Main-list-item__name'
                    }
                >
                    {name}
                </span>
                <span className="Main-list-item__date">{date}</span>
                <span className="Main-list-item__date">{time}</span>
                <img src={image} alt={name} width={350} height={350} />
                <div className="Main-list-item__bot">
                    <button
                        className={
                             complet
                                ? 'Main-list-item__completed _completed'
                                : 'Main-list-item__completed'
                        }
                        title="просмотрено"
                        onClick={this.onComplet}
                    >
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            viewBox="0 0 512 512"
                            width="30px"
                            height="30px"
                        >
                            <path
                                fill="#fff"
                                d="M424.3,180c-1-1.2-1.5-2.8-1.5-4.3c-14.8-26.1-15.7-58-30.5-84.1c-41.7,23.4-70.2,65.1-97.4,103.1c-16.4,22.9-31.1,46.4-44.6,71.1c-13.6,24.8-26.8,49.9-42,73.8c-2.2,3.4-7.9,5-10.3,0.7c-7.2-13.3-15.3-26.2-24.6-38.2c-8-10.3-17.1-19.5-25.3-29.6c-12.7-15.7-26.3-34.5-43.9-45.4c-6.4,21-13.9,41.8-17.2,63.6c24.6,15.9,43.4,38.9,61.5,61.6c21.2,26.6,43.1,52,66.9,76.3c15.4-20.1,26-43.5,38.8-65.3c15.1-25.7,32.7-49.4,51.4-72.6c18.7-23.2,40.3-43.7,62-63.9c10.2-9.5,22.2-17.3,33.1-26c8.2-6.6,16.2-13.4,23.7-20.7C424.4,180.2,424.4,180.1,424.3,180z"
                            />
                            <path d="M436.2,170.3h-2.8c-16.3-27.7-16.2-62.6-34-89.9c-1.9-3-5.4-3.1-8.3-1.6c-45.6,23.1-76.2,67.7-105.2,108.1c-16.6,23.2-31.6,47-45.4,72c-12.3,22.3-24.1,44.8-37.4,66.6c-6-10.4-12.6-20.4-19.9-29.9c-8.2-10.8-17.8-20.3-26.3-30.8c-15.2-18.7-31.4-40.9-53.7-51.5c-3.7-1.8-7.4,0.5-8.5,4.2c-6.8,23.7-15.8,47-19.5,71.4c0,0.1,0,0.2,0,0.4c-2,2.7-2.2,7.1,1.6,9.4c26.5,15.6,46,40.8,64.9,64.6c22,27.7,45.2,54.1,70.2,79.1c2.3,2.3,6.4,1.8,8.4-0.5c17.2-20.6,28.7-45,41.8-68.2c14.7-25.9,32-50.3,51.1-73.2c19.2-22.9,40-43.7,61.9-64c10.4-9.7,22.6-17.7,33.8-26.6c9-7.2,17.7-14.7,25.9-22.8c2.3-0.5,4.2-2.1,4.6-4.7c0.6-0.6,1.2-1.3,1.8-1.9C445,176.1,441.2,170.3,436.2,170.3z M400.7,201c-10.9,8.7-22.8,16.5-33.1,26c-21.8,20.2-43.4,40.7-62,63.9c-18.7,23.2-36.3,46.8-51.4,72.6c-12.8,21.8-23.4,45.2-38.8,65.3c-23.8-24.2-45.8-49.7-66.9-76.3c-18.1-22.7-37-45.8-61.5-61.6c3.3-21.8,10.8-42.6,17.2-63.6c17.7,10.9,31.2,29.7,43.9,45.4c8.2,10.1,17.3,19.3,25.3,29.6c9.3,12,17.4,24.9,24.6,38.2c2.4,4.4,8.1,2.7,10.3-0.7c15.3-23.9,28.4-49,42-73.8c13.5-24.7,28.2-48.2,44.6-71.1c27.2-38,55.8-79.8,97.4-103.1c14.8,26.1,15.7,58,30.5,84.1c0,1.5,0.5,3.1,1.5,4.3c0,0.1,0.1,0.2,0.1,0.2C416.9,187.6,408.9,194.4,400.7,201z" />
                        </svg>
                    </button>
                    <button
                        className={
                            favorite
                                ? 'Main-list-item__fav _favorite'
                                : 'Main-list-item__fav'
                        }
                        title="избранное"
                        onClick={this.onFavorite}
                    >
                        <svg
                            width="25"
                            height="25"
                            viewBox="0 0 24 22"
                            fill="none"
                            xmlns="http://www.w3.org/2000/svg"
                        >
                            <path
                                d="M12 8.22892C12.234 7.10892 13.547 1.99992 17.382 1.99992C19.602 1.99992 22 3.55092 22 7.00292C22 10.9099 18.373 15.4729 12 19.6319C5.627 15.4729 2 10.9099 2 7.00292C2 3.51892 4.369 1.99792 6.577 1.99792C10.5 1.99792 11.722 7.12392 12 8.22892ZM0 7.00292C0 11.0709 3.06 16.4839 12 21.9999C20.94 16.4839 24 11.0709 24 7.00292C24 -0.959077 14.352 -2.02508 12 3.26592C9.662 -1.99608 0 -1.00408 0 7.00292Z"
                                fill="#fff"
                            />
                        </svg>
                    </button>
                    <button title="удалить" onClick={onDelete}>
                        <svg viewBox="0 0 100 100" width="35px" height="35px">
                            <path
                                fill="#f37e98"
                                d="M25,30l3.645,47.383C28.845,79.988,31.017,82,33.63,82h32.74c2.613,0,4.785-2.012,4.985-4.617L75,30"
                            />
                            <path
                                fill="#f15b6c"
                                d="M65 38v35c0 1.65-1.35 3-3 3s-3-1.35-3-3V38c0-1.65 1.35-3 3-3S65 36.35 65 38zM53 38v35c0 1.65-1.35 3-3 3s-3-1.35-3-3V38c0-1.65 1.35-3 3-3S53 36.35 53 38zM41 38v35c0 1.65-1.35 3-3 3s-3-1.35-3-3V38c0-1.65 1.35-3 3-3S41 36.35 41 38zM77 24h-4l-1.835-3.058C70.442 19.737 69.14 19 67.735 19h-35.47c-1.405 0-2.707.737-3.43 1.942L27 24h-4c-1.657 0-3 1.343-3 3s1.343 3 3 3h54c1.657 0 3-1.343 3-3S78.657 24 77 24z"
                            />
                            <path
                                fill="#1f212b"
                                d="M66.37 83H33.63c-3.116 0-5.744-2.434-5.982-5.54l-3.645-47.383 1.994-.154 3.645 47.384C29.801 79.378 31.553 81 33.63 81H66.37c2.077 0 3.829-1.622 3.988-3.692l3.645-47.385 1.994.154-3.645 47.384C72.113 80.566 69.485 83 66.37 83zM56 20c-.552 0-1-.447-1-1v-3c0-.552-.449-1-1-1h-8c-.551 0-1 .448-1 1v3c0 .553-.448 1-1 1s-1-.447-1-1v-3c0-1.654 1.346-3 3-3h8c1.654 0 3 1.346 3 3v3C57 19.553 56.552 20 56 20z"
                            />
                            <path
                                fill="#1f212b"
                                d="M77,31H23c-2.206,0-4-1.794-4-4s1.794-4,4-4h3.434l1.543-2.572C28.875,18.931,30.518,18,32.265,18h35.471c1.747,0,3.389,0.931,4.287,2.428L73.566,23H77c2.206,0,4,1.794,4,4S79.206,31,77,31z M23,25c-1.103,0-2,0.897-2,2s0.897,2,2,2h54c1.103,0,2-0.897,2-2s-0.897-2-2-2h-4c-0.351,0-0.677-0.185-0.857-0.485l-1.835-3.058C69.769,20.559,68.783,20,67.735,20H32.265c-1.048,0-2.033,0.559-2.572,1.457l-1.835,3.058C27.677,24.815,27.351,25,27,25H23z"
                            />
                            <path
                                fill="#1f212b"
                                d="M61.5 25h-36c-.276 0-.5-.224-.5-.5s.224-.5.5-.5h36c.276 0 .5.224.5.5S61.776 25 61.5 25zM73.5 25h-5c-.276 0-.5-.224-.5-.5s.224-.5.5-.5h5c.276 0 .5.224.5.5S73.776 25 73.5 25zM66.5 25h-2c-.276 0-.5-.224-.5-.5s.224-.5.5-.5h2c.276 0 .5.224.5.5S66.776 25 66.5 25zM50 76c-1.654 0-3-1.346-3-3V38c0-1.654 1.346-3 3-3s3 1.346 3 3v25.5c0 .276-.224.5-.5.5S52 63.776 52 63.5V38c0-1.103-.897-2-2-2s-2 .897-2 2v35c0 1.103.897 2 2 2s2-.897 2-2v-3.5c0-.276.224-.5.5-.5s.5.224.5.5V73C53 74.654 51.654 76 50 76zM62 76c-1.654 0-3-1.346-3-3V47.5c0-.276.224-.5.5-.5s.5.224.5.5V73c0 1.103.897 2 2 2s2-.897 2-2V38c0-1.103-.897-2-2-2s-2 .897-2 2v1.5c0 .276-.224.5-.5.5S59 39.776 59 39.5V38c0-1.654 1.346-3 3-3s3 1.346 3 3v35C65 74.654 63.654 76 62 76z"
                            />
                            <path
                                fill="#1f212b"
                                d="M59.5 45c-.276 0-.5-.224-.5-.5v-2c0-.276.224-.5.5-.5s.5.224.5.5v2C60 44.776 59.776 45 59.5 45zM38 76c-1.654 0-3-1.346-3-3V38c0-1.654 1.346-3 3-3s3 1.346 3 3v35C41 74.654 39.654 76 38 76zM38 36c-1.103 0-2 .897-2 2v35c0 1.103.897 2 2 2s2-.897 2-2V38C40 36.897 39.103 36 38 36z"
                            />
                        </svg>
                    </button>
                </div>
            </li>
        );
    }
}

export default MainListItem;
